{
  "architectures": [
    "QWenSophgo"
  ],
  "core_num": 8,
  "device_id": [8,9,10,11,12,13,14,15],
  "model_path": "/data/ziyang.wang/qwen-14b-combine",
  "bmodel_name":"qwen-14b_8dev.bmodel",
  "model_quantization":"w8f16",
  "kv_block_num":500,
  "prefill_bmodel_size":512,
  "decode_bmodel_size":16,

  "attn_dropout_prob": 0.0,
  "bf16": true,
  "emb_dropout_prob": 0.0,
  "fp16": false,
  "fp32": false,
  "hidden_size": 5120,
  "intermediate_size": 27392,
  "initializer_range": 0.02,
  "kv_channels": 128,
  "layer_norm_epsilon": 1e-06,
  "max_position_embeddings": 8192,
  "model_type": "qwen2",
  "no_bias": true,
  "num_attention_heads": 40,
  "num_key_value_heads": 40,
  "num_hidden_layers": 40,
  "onnx_safe": null,
  "rotary_emb_base": 10000,
  "rotary_pct": 1.0,
  "scale_attn_weights": true,
  "seq_length": 4096,
  "tie_word_embeddings": false,
  "tokenizer_class": "QWenTokenizer",
  "transformers_version": "4.32.0",
  "use_cache": true,
  "use_dynamic_ntk": true,
  "use_flash_attn": "auto",
  "use_logn_attn": true,
  "vocab_size": 152064
}
